app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "image", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test"], ["image", "el8le-logo"], ["content", "Test"], ["user_id", 1], ["created_at", "2016-12-10 22:18:53.740981"], ["updated_at", "2016-12-10 22:18:53.740981"]]
---
  def create
    @post = current_user.posts.build(post_params)

    if @post.save

UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "hvc.png"], ["updated_at", "2016-12-10 23:31:02.945507"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)